# PANDAS

## Objective of the season

• Understand what a Series object is and what its relationship is within Dataframes .

• Know the functionalities and fundamental transformations that we can carry out in dataframes 

We import the pandas library to be able to work with DataFrames in Python, **in case it is not installed by default** we can do the following:
* <code>pip install pandas</code>
* <code>conda install pandas</code>
* <code>conda install -c anaconda pandas </code>

In [1]:
# Import pandas 
import pandas as pd

## What is pandas ?

* It is a library dedicated to data processing in the form of matrices or data tables (__PAN__el __DA__ta ).
* One of the quintessential libraries for data science.
* Data structures with which we work: Series and Dataframes .
* A succession of series composes a Dataframe
* pip installation may be required install pandas
* Commonly used with the alias pd
* To import the library, import pandas as pd is used.

![Imagen1.png](Images/Imagen1.png)

## Series

It is an indexed collection that works in a similar way to a data dictionary, it is the minimum unit with which we can work in Pandas, in fact, a Dataframe is nothing more than a succession of series.

We must take into account that the series work in a similar way to a data dictionary where we have the files formed by {key_1: 'value one', key_2. 'value two', ....., key_n: 'value m'}. The series can be formed through a numpy array or a list and some values that will act as indexes (if they are not entered, they will be taken by default from 0 to the length of the set of elements).

To create a series, we will simply use the function <code>**Series**</code>

In [2]:
a = {
    "uno" : 1,
    "dos" : 2
}

a

{'uno': 1, 'dos': 2}

In [3]:
criptos = pd.Series(
    [15613.77, 496.29, 0.52, 0.83, 242.03], 
    index= ['Bitcoin', 'Ethereum', 'XRP', 'Tether', 'BTC Cash']
)

criptos

Bitcoin     15613.77
Ethereum      496.29
XRP             0.52
Tether          0.83
BTC Cash      242.03
dtype: float64

Series object has their own class

In [4]:
type(criptos)

pandas.core.series.Series

In [5]:
lista = [1, 2, 3, 4, 100]

import numpy as np

arr = np.array(lista)

In [6]:
type(lista)

list

In [7]:
type(arr)

numpy.ndarray

In [8]:
lista * 2

[1, 2, 3, 4, 100, 1, 2, 3, 4, 100]

In [9]:
arr * 2

array([  2,   4,   6,   8, 200])

In [10]:
isinstance(arr, np.ndarray)

True

In [11]:
isinstance(arr, list)

False

In [12]:
type(lista)

list

In [13]:
type(5)

int

In [14]:
type('5')

str

In [15]:
int('5')

5

In [16]:
# if isinstance(arr, list) is False:
#     # Multiplica *2
# else:
#     lista = lista.asarry()
#     for item in lista:
#         # item * 2

### Question.

An objetct of class pandas.Series looks similar to a dictionary, it has same functions like keys or values ?

In [17]:
criptos

Bitcoin     15613.77
Ethereum      496.29
XRP             0.52
Tether          0.83
BTC Cash      242.03
dtype: float64

In [18]:
a

{'uno': 1, 'dos': 2}

In [19]:
a.keys()

dict_keys(['uno', 'dos'])

In [20]:
a.values()

dict_values([1, 2])

In [21]:
a.items()

dict_items([('uno', 1), ('dos', 2)])

In [22]:
criptos.keys()

Index(['Bitcoin', 'Ethereum', 'XRP', 'Tether', 'BTC Cash'], dtype='object')

In [23]:
criptos.values

array([1.561377e+04, 4.962900e+02, 5.200000e-01, 8.300000e-01,
       2.420300e+02])

In [24]:
criptos.items()

In [25]:
for row, value in criptos.items():
    print(row, value)

Bitcoin 15613.77
Ethereum 496.29
XRP 0.52
Tether 0.83
BTC Cash 242.03

In [26]:
criptos.values.sort()

In [27]:
criptos

Bitcoin         0.52
Ethereum        0.83
XRP           242.03
Tether        496.29
BTC Cash    15613.77
dtype: float64

In [28]:
aux = np.array([100, 200, 300])

In [29]:
mi_copia = aux
mi_copia

array([100, 200, 300])

In [30]:
mi_copia[0] = 5000

In [31]:
mi_copia

array([5000,  200,  300])

In [32]:
aux

array([5000,  200,  300])

Realizar bien las copias con la función `copy`. Lo que hacemos es almacenar el objeto en posiciones distintas de memoria, pasa lo  mismo con los __dataframes__. La alteración o modificación de valores es bidireccional, tanto de a -> b, como de a <- b

In [33]:
aux

array([5000,  200,  300])

In [34]:
mi_copia = aux.copy()

In [35]:
mi_copia

array([5000,  200,  300])

In [36]:
mi_copia[2] = 90000

In [37]:
mi_copia

array([ 5000,   200, 90000])

In [38]:
aux

array([5000,  200,  300])

In [39]:
b = np.array([1, 2])
c = b

In [40]:
b[0] = 100
b

array([100,   2])

In [41]:
c

array([100,   2])

## Dataframes

![Imagen2.jpg](Images/Imagen2.jpg)

We can use as Dataframe almost all types of data structures like array, list, dictionary... the function to create a Pandas Dataframe is
* <code>__pandas.DataFrame()__</code>

* Through **Series**

In [42]:
criptos

Bitcoin         0.52
Ethereum        0.83
XRP           242.03
Tether        496.29
BTC Cash    15613.77
dtype: float64

In [43]:
# Create an object Series
df_criptos = pd.DataFrame(criptos)

# By default names of columns are created from 0
df_criptos

                 0
Bitcoin       0.52
Ethereum      0.83
XRP         242.03
Tether      496.29
BTC Cash  15613.77

* Through **Numpy Array**

In [44]:
df_arr = pd.DataFrame(mi_copia)
df_arr

       0
0   5000
1    200
2  90000

It is important to highlight in the previous example, that by not using any parameter as an index, it has automatically taken values from 0 to n

* Through **List**

In [45]:
lista

[1, 2, 3, 4, 100]

In [46]:
pd.DataFrame(lista)

     0
0    1
1    2
2    3
3    4
4  100

* Through **diccionario de datos**

In [47]:
mi_dict = {
    "coche" : "car",
    "arbol" : "tree",
    "raton" : "mouse",
    "botella" : "bottle",
    "numero" : "number"
}

In [48]:
pd.DataFrame.from_dict(mi_dict, orient="index")

              0
coche       car
arbol      tree
raton     mouse
botella  bottle
numero   number

In [49]:
mi_dict = {
    "coche" : [10, 20, 30, 40],
    "arbol" : ["hola", "adios"],
    "raton" : "mouse",
    "botella" : np.arange(10),
    "numero" : "number"
}

In [50]:
mi_dict

{'coche': [10, 20, 30, 40],
 'arbol': ['hola', 'adios'],
 'raton': 'mouse',
 'botella': array([0, 1, 2, 3, 4, 5, 6, 7, 8, 9]),
 'numero': 'number'}

In [51]:
pd.DataFrame.from_dict(mi_dict, orient="index")

            0      1     2     3     4     5    6    7    8    9
coche      10     20    30    40  None  None  NaN  NaN  NaN  NaN
arbol    hola  adios  None  None  None  None  NaN  NaN  NaN  NaN
raton       m      o     u     s     e  None  NaN  NaN  NaN  NaN
botella     0      1     2     3     4     5  6.0  7.0  8.0  9.0
numero      n      u     m     b     e     r  NaN  NaN  NaN  NaN

In [52]:
mi_dict = {
    "coche" : "car",
    "arbol" : "tree",
    "raton" : "mouse",
    "botella" : "bottle",
    "numero" : "number"
}

In [53]:
# pd.DataFrame.from_dict(mi_dict, orient="columns")

Note that when dealing with a data dictionary, we have to use the **orient** parameter to correctly recognize the key field as an index. Otherwise, we can use the parameter **index**

### Loading CVS file as Dataframes

One of the great advantages of working with DataFrames is that we can load files very easily and be able to process their rows and columns. There are several types of data that we can load to pandas:

* CSV
* JSON
* HTML
* EXCEL
* HDF5
* TXT
* ORC
* STATA
* ...

All the types of data that we can load are found in the following link: https://pandas.pydata.org/docs/user_guide/io.html#io

Throughout the content we will show the main functionalities of dataframes from csv as dataframe.

To load a csv as a Dataframe we have the function </code>**read_csv**</code>

https://www.kaggle.com/datasets/camnugent/california-housing-prices

In [54]:
df = pd.read_csv("CR_Files/housing_California.csv")

In [55]:
df

,longitude,latitude,housing_median_age,total_rooms,total_bedrooms,population,households,median_income,median_house_value,ocean_proximity
0,-122.23,37.88,41.0,880.0,129.0,322.0,126.0,8.3252,452600.0,NEAR BAY
1,-122.22,37.86,21.0,7099.0,1106.0,2401.0,1138.0,8.3014,358500.0,NEAR BAY
2,-122.24,37.85,52.0,1467.0,190.0,496.0,177.0,7.2574,352100.0,NEAR BAY
3,-122.25,37.85,52.0,1274.0,235.0,558.0,219.0,5.6431,341300.0,NEAR BAY
4,-122.25,37.85,52.0,1627.0,280.0,565.0,259.0,3.8462,342200.0,NEAR BAY
...,...,...,...,...,...,...,...,...,...,...
20635,-121.09,39.48,25.0,1665.0,374.0,845.0,330.0,1.5603,78100.0,INLAND
20636,-121.21,39.49,18.0,697.0,150.0,356.0,114.0,2.5568,77100.0,INLAND
20637,-121.22,39.43,17.0,2254.0,485.0,1007.0,433.0,1.7000,92300.0,INLAND
20638,-121.32,39.43,18.0,1860.0,409.0,741.0,349.0,1.8672,84700.0,INLAND
20639,-121.24,39.37,16.0,2785.0,616.0,1387.0,530.0,2.3886,89400.0,INLAND

In [56]:
pd.read_csv("CR_Files/compras_dos.csv", sep=";")

        FECHA              ARTICULO  CUANTIA  PRECIO UNIDAD   TOTAL
0  15/03/2020             Barra Pan        2           0.55    1.10
1  16/03/2020         Bolígrafo Bic        3           0.22    0.66
2  17/03/2020              Cuaderno        1           1.25    1.25
3  18/03/2020              Refresco        5           0.80    4.00
4  19/03/2020           Silla Gamer        1         153.00  153.00
5  20/03/2020     Paquete folios A4        3           2.48    7.44
6  21/03/2020  Pack x6 Vaso cristal        2           6.00   12.00
7  22/03/2020        Manzanas (Kg.)        1           2.48    2.48
8  23/03/2020        Naranjas (Kg.)        2           1.29    2.58
9  24/03/2020         Naranja Malla        1           1.50    1.50

### Series and columns of a Dataframe

As we have seen before, a dataframe is a succession or collection of series, that is, each column acts as a series since all the columns share the same index.

To access a column we have to write the name of the column in square brackets.

In [57]:
criptos

Bitcoin         0.52
Ethereum        0.83
XRP           242.03
Tether        496.29
BTC Cash    15613.77
dtype: float64

In [58]:
df['longitude']

0       -122.23
1       -122.22
2       -122.24
3       -122.25
4       -122.25
          ...
20635   -121.09
20636   -121.21
20637   -121.22
20638   -121.32
20639   -121.24
Name: longitude, Length: 20640, dtype: float64

In [59]:
df['longitude'][180]

-122.24

In [60]:
df.longitude

0       -122.23
1       -122.22
2       -122.24
3       -122.25
4       -122.25
          ...
20635   -121.09
20636   -121.21
20637   -121.22
20638   -121.32
20639   -121.24
Name: longitude, Length: 20640, dtype: float64

In [61]:
compras = pd.read_csv("CR_Files/compras_dos.csv", sep=";")

In [62]:
compras["PRECIO UNIDAD"]

0      0.55
1      0.22
2      1.25
3      0.80
4    153.00
5      2.48
6      6.00
7      2.48
8      1.29
9      1.50
Name: PRECIO UNIDAD, dtype: float64

If we look at the type of class that has a column we will see that it is Series

In [63]:
type(compras["PRECIO UNIDAD"])

pandas.core.series.Series

In [64]:
type(df)

pandas.core.frame.DataFrame

Another way to get the column is similar than SQL:

* df_name.__nombre_columna__

In [65]:
df.ocean_proximity

0        NEAR BAY
1        NEAR BAY
2        NEAR BAY
3        NEAR BAY
4        NEAR BAY
           ...
20635      INLAND
20636      INLAND
20637      INLAND
20638      INLAND
20639      INLAND
Name: ocean_proximity, Length: 20640, dtype: object

### Selecting multiple columns

Now that we have seen how a DataFrame is made up of Series, we can see how to select multiple columns. To do this, we simply have to enclose the names of the columns that we want to select in square brackets, such as:

__df_name[['column_one', 'column_two', 'column_three']]__

Similarly, we can pass a list with names of the columns.

To do the same by means of indexing, that is, to obtain a subset of the columns of the dataframe by the position occupied by the columns, we can do:
* __dataframe_name[dataframe_name.columns[[col_n, col_m]]]__
* __dataframe_name.iloc[:, [col_n, col_m]]__

Using column names.

In [66]:
df.columns

Index(['longitude', 'latitude', 'housing_median_age', 'total_rooms',
       'total_bedrooms', 'population', 'households', 'median_income',
       'median_house_value', 'ocean_proximity'],
      dtype='object')

In [67]:
df[["longitude", "latitude"]]

       longitude  latitude
0        -122.23     37.88
1        -122.22     37.86
2        -122.24     37.85
3        -122.25     37.85
4        -122.25     37.85
...          ...       ...
20635    -121.09     39.48
20636    -121.21     39.49
20637    -121.22     39.43
20638    -121.32     39.43
20639    -121.24     39.37

[20640 rows x 2 columns]

In [68]:
target = ["ocean_proximity", "total_bedrooms"]

df[target]

      ocean_proximity  total_bedrooms
0            NEAR BAY           129.0
1            NEAR BAY          1106.0
2            NEAR BAY           190.0
3            NEAR BAY           235.0
4            NEAR BAY           280.0
...               ...             ...
20635          INLAND           374.0
20636          INLAND           150.0
20637          INLAND           485.0
20638          INLAND           409.0
20639          INLAND           616.0

[20640 rows x 2 columns]

Through index

In [69]:
df.columns[0]

'longitude'

In [70]:
df[df.columns[0]]
# df['longitude']

0       -122.23
1       -122.22
2       -122.24
3       -122.25
4       -122.25
          ...
20635   -121.09
20636   -121.21
20637   -121.22
20638   -121.32
20639   -121.24
Name: longitude, Length: 20640, dtype: float64

In [71]:
df.columns[2:8:2]

Index(['housing_median_age', 'total_bedrooms', 'households'], dtype='object')

In [72]:
df[df.columns[2:8:2]]

       housing_median_age  total_bedrooms  households
0                    41.0           129.0       126.0
1                    21.0          1106.0      1138.0
2                    52.0           190.0       177.0
3                    52.0           235.0       219.0
4                    52.0           280.0       259.0
...                   ...             ...         ...
20635                25.0           374.0       330.0
20636                18.0           150.0       114.0
20637                17.0           485.0       433.0
20638                18.0           409.0       349.0
20639                16.0           616.0       530.0

[20640 rows x 3 columns]

In [73]:
df.columns[1]

'latitude'

In [74]:
df[df.columns[1:4]]

       latitude  housing_median_age  total_rooms
0         37.88                41.0        880.0
1         37.86                21.0       7099.0
2         37.85                52.0       1467.0
3         37.85                52.0       1274.0
4         37.85                52.0       1627.0
...         ...                 ...          ...
20635     39.48                25.0       1665.0
20636     39.49                18.0        697.0
20637     39.43                17.0       2254.0
20638     39.43                18.0       1860.0
20639     39.37                16.0       2785.0

[20640 rows x 3 columns]

In [75]:
df[df.columns[1:4]]

       latitude  housing_median_age  total_rooms
0         37.88                41.0        880.0
1         37.86                21.0       7099.0
2         37.85                52.0       1467.0
3         37.85                52.0       1274.0
4         37.85                52.0       1627.0
...         ...                 ...          ...
20635     39.48                25.0       1665.0
20636     39.49                18.0        697.0
20637     39.43                17.0       2254.0
20638     39.43                18.0       1860.0
20639     39.37                16.0       2785.0

[20640 rows x 3 columns]

In [76]:
df[['latitude', 'housing_median_age', 'total_rooms']]

       latitude  housing_median_age  total_rooms
0         37.88                41.0        880.0
1         37.86                21.0       7099.0
2         37.85                52.0       1467.0
3         37.85                52.0       1274.0
4         37.85                52.0       1627.0
...         ...                 ...          ...
20635     39.48                25.0       1665.0
20636     39.49                18.0        697.0
20637     39.43                17.0       2254.0
20638     39.43                18.0       1860.0
20639     39.37                16.0       2785.0

[20640 rows x 3 columns]

To select multiple columns with **iloc**, we have to take into account that a dataframe is distributed in the following way.

* __dataframe[rows, columns]__: Where both rows and columns are indexable

In [77]:
# df.iloc[filas,  columnas]
# df.iloc[star:end:step,  star:end:step]

In [78]:
df.columns

Index(['longitude', 'latitude', 'housing_median_age', 'total_rooms',
       'total_bedrooms', 'population', 'households', 'median_income',
       'median_house_value', 'ocean_proximity'],
      dtype='object')

In [79]:
df.iloc[ : , [1,3]  ]

       latitude  total_rooms
0         37.88        880.0
1         37.86       7099.0
2         37.85       1467.0
3         37.85       1274.0
4         37.85       1627.0
...         ...          ...
20635     39.48       1665.0
20636     39.49        697.0
20637     39.43       2254.0
20638     39.43       1860.0
20639     39.37       2785.0

[20640 rows x 2 columns]

In [80]:
df.iloc[ : , 2:6  ]

       housing_median_age  total_rooms  total_bedrooms  population
0                    41.0        880.0           129.0       322.0
1                    21.0       7099.0          1106.0      2401.0
2                    52.0       1467.0           190.0       496.0
3                    52.0       1274.0           235.0       558.0
4                    52.0       1627.0           280.0       565.0
...                   ...          ...             ...         ...
20635                25.0       1665.0           374.0       845.0
20636                18.0        697.0           150.0       356.0
20637                17.0       2254.0           485.0      1007.0
20638                18.0       1860.0           409.0       741.0
20639                16.0       2785.0           616.0      1387.0

[20640 rows x 4 columns]

### Selecting multiple rows

In general, we can use the same properties as for lists, except to select a single row that is different:
* To select from the first row to a limit we perform: <code>__dataframe[0:n]__</code>, similarly we can omit the zero and simply perform: <code>__dataframe[ :n]__</code>
* To select from a row to the end we do: <code>__dataframe[n:]__</code>
* To select a defined range of rows we do: <code>__dataframe[n:m]__</code>

In [81]:
df[0:10]

,longitude,latitude,housing_median_age,total_rooms,total_bedrooms,population,households,median_income,median_house_value,ocean_proximity
0,-122.23,37.88,41.0,880.0,129.0,322.0,126.0,8.3252,452600.0,NEAR BAY
1,-122.22,37.86,21.0,7099.0,1106.0,2401.0,1138.0,8.3014,358500.0,NEAR BAY
2,-122.24,37.85,52.0,1467.0,190.0,496.0,177.0,7.2574,352100.0,NEAR BAY
3,-122.25,37.85,52.0,1274.0,235.0,558.0,219.0,5.6431,341300.0,NEAR BAY
4,-122.25,37.85,52.0,1627.0,280.0,565.0,259.0,3.8462,342200.0,NEAR BAY
5,-122.25,37.85,52.0,919.0,213.0,413.0,193.0,4.0368,269700.0,NEAR BAY
6,-122.25,37.84,52.0,2535.0,489.0,1094.0,514.0,3.6591,299200.0,NEAR BAY
7,-122.25,37.84,52.0,3104.0,687.0,1157.0,647.0,3.1200,241400.0,NEAR BAY
8,-122.26,37.84,42.0,2555.0,665.0,1206.0,595.0,2.0804,226700.0,NEAR BAY
9,-122.25,37.84,52.0,3549.0,707.0,1551.0,714.0,3.6912,261100.0,NEAR BAY

In [82]:
df[ : 100]

,longitude,latitude,housing_median_age,total_rooms,total_bedrooms,population,households,median_income,median_house_value,ocean_proximity
0,-122.23,37.88,41.0,880.0,129.0,322.0,126.0,8.3252,452600.0,NEAR BAY
1,-122.22,37.86,21.0,7099.0,1106.0,2401.0,1138.0,8.3014,358500.0,NEAR BAY
2,-122.24,37.85,52.0,1467.0,190.0,496.0,177.0,7.2574,352100.0,NEAR BAY
3,-122.25,37.85,52.0,1274.0,235.0,558.0,219.0,5.6431,341300.0,NEAR BAY
4,-122.25,37.85,52.0,1627.0,280.0,565.0,259.0,3.8462,342200.0,NEAR BAY
...,...,...,...,...,...,...,...,...,...,...
95,-122.26,37.80,36.0,5329.0,2477.0,3469.0,2323.0,2.0096,130000.0,NEAR BAY
96,-122.26,37.82,31.0,4596.0,1331.0,2048.0,1180.0,2.8345,183800.0,NEAR BAY
97,-122.26,37.81,29.0,335.0,107.0,202.0,91.0,2.0062,125000.0,NEAR BAY
98,-122.26,37.82,22.0,3682.0,1270.0,2024.0,1250.0,1.2185,170000.0,NEAR BAY
99,-122.26,37.82,37.0,3633.0,1085.0,1838.0,980.0,2.6104,193100.0,NEAR BAY

In [83]:
df[:200:2]

,longitude,latitude,housing_median_age,total_rooms,total_bedrooms,population,households,median_income,median_house_value,ocean_proximity
0,-122.23,37.88,41.0,880.0,129.0,322.0,126.0,8.3252,452600.0,NEAR BAY
2,-122.24,37.85,52.0,1467.0,190.0,496.0,177.0,7.2574,352100.0,NEAR BAY
4,-122.25,37.85,52.0,1627.0,280.0,565.0,259.0,3.8462,342200.0,NEAR BAY
6,-122.25,37.84,52.0,2535.0,489.0,1094.0,514.0,3.6591,299200.0,NEAR BAY
8,-122.26,37.84,42.0,2555.0,665.0,1206.0,595.0,2.0804,226700.0,NEAR BAY
...,...,...,...,...,...,...,...,...,...,...
190,-122.24,37.79,52.0,674.0,180.0,647.0,168.0,3.3750,116100.0,NEAR BAY
192,-122.25,37.79,51.0,175.0,43.0,228.0,55.0,2.1000,75000.0,NEAR BAY
194,-122.25,37.79,52.0,902.0,237.0,846.0,227.0,3.6250,125000.0,NEAR BAY
196,-122.22,37.77,52.0,391.0,128.0,520.0,138.0,1.6471,95000.0,NEAR BAY
198,-122.23,37.77,52.0,769.0,206.0,612.0,183.0,2.5700,72000.0,NEAR BAY

In [84]:
df[20300: ]

,longitude,latitude,housing_median_age,total_rooms,total_bedrooms,population,households,median_income,median_house_value,ocean_proximity
20300,-119.19,34.15,31.0,4175.0,1004.0,3310.0,954.0,3.1989,185400.0,NEAR OCEAN
20301,-119.20,34.15,27.0,2076.0,681.0,1904.0,647.0,1.4773,160800.0,NEAR OCEAN
20302,-119.21,34.12,15.0,5778.0,1285.0,1722.0,829.0,4.3427,305800.0,NEAR OCEAN
20303,-119.18,34.16,12.0,460.0,101.0,405.0,103.0,5.2783,167400.0,NEAR OCEAN
20304,-119.18,34.16,27.0,1832.0,415.0,1480.0,414.0,3.9643,186000.0,NEAR OCEAN
...,...,...,...,...,...,...,...,...,...,...
20635,-121.09,39.48,25.0,1665.0,374.0,845.0,330.0,1.5603,78100.0,INLAND
20636,-121.21,39.49,18.0,697.0,150.0,356.0,114.0,2.5568,77100.0,INLAND
20637,-121.22,39.43,17.0,2254.0,485.0,1007.0,433.0,1.7000,92300.0,INLAND
20638,-121.32,39.43,18.0,1860.0,409.0,741.0,349.0,1.8672,84700.0,INLAND
20639,-121.24,39.37,16.0,2785.0,616.0,1387.0,530.0,2.3886,89400.0,INLAND

In [85]:
df[20300:20300]

Empty DataFrame
Columns: [longitude, latitude, housing_median_age, total_rooms, total_bedrooms, population, households, median_income, median_house_value, ocean_proximity]
Index: []

To select a single row we cannot do the same operation as in the lists, index a single position <code>lista[n]</code>, since this does not return anything, for this, we have to select as a custom range the row we want to display plus one position <code>dataframe[n:n+1]</code>

In [86]:
df[20300:20301]

,longitude,latitude,housing_median_age,total_rooms,total_bedrooms,population,households,median_income,median_house_value,ocean_proximity
20300,-119.19,34.15,31.0,4175.0,1004.0,3310.0,954.0,3.1989,185400.0,NEAR OCEAN

### iloc Function Summary

With the __.iloc__ function we can select several rows in a very simple way that can be summarized as:
* <code>dataframe.iloc[0]</code> - First row of a dataframe.
* <code>dataframe.iloc[1]</code> - Second row of a dataframe.
* <code>dataframe.iloc[-1]</code> - (Negative indexing) Last row of a dataframe
* <code>dataframe.iloc[[n]]</code> - Row _n_ of the dataframe.
* <code>dataframe.iloc[n:m]</code> - Custom range of rows _n_ to _m_

In columns, the summary of the __.iloc__ function would become:
* <code>dataframe.iloc[:, 0]</code> - First column of a dataframe.
* <code>dataframe.iloc[:, 1]</code> - Second column of a dataframe.
* <code>dataframe.iloc[:, -1]</code> - (Negative indexing) Last column of a dataframe
* <code>dataframe.iloc[:,[n,m]]</code> - Exactly, the _n_ and _m_ columns of a dataframe.
* <code>dataframe.iloc[:, n:m]</code> - Custom range of columns _n_ to _m_ of a dataframe.

We can also perform multiple row column selection with __.iloc__ with the following examples:
* <code>dataframe.iloc[[0,5,7,9], [1,4]]</code> - Selection of rows 0,5,7,9 from columns 1 and 4
* <code>dataframe.iloc[0:10, 0:2]</code> - Range-based selection of rows 0 to 10 from columns 0 to 2

In [87]:
df.iloc[-2] # Penúltma fila

longitude             -121.32
latitude                39.43
housing_median_age       18.0
total_rooms            1860.0
total_bedrooms          409.0
population              741.0
households              349.0
median_income          1.8672
median_house_value    84700.0
ocean_proximity        INLAND
Name: 20638, dtype: object

In [88]:
df.iloc[:, [-1]] # Última columna

      ocean_proximity
0            NEAR BAY
1            NEAR BAY
2            NEAR BAY
3            NEAR BAY
4            NEAR BAY
...               ...
20635          INLAND
20636          INLAND
20637          INLAND
20638          INLAND
20639          INLAND

[20640 rows x 1 columns]

In [89]:
df.iloc[[0,5,7,9], [1,4]]

   latitude  total_bedrooms
0     37.88           129.0
5     37.85           213.0
7     37.84           687.0
9     37.84           707.0

### Indexes of a DataFrame

These are the positions occupied by each row within a dataframe, unless a specific type of index is specified based on labels, the indexes will be from 0 to the total length of the dataframe

In [90]:
# Create a df
sales = {
   'region': ["EUROPA", "EUROPA", "EUROPA", 
              "USA", "USA", "USA", "LATAM", "LATAM"],
   'sales':[153752, 168742, 162587, 256198, 285743, 290371, 145638, 151678],
   'year':[2018, 2019, 2020, 2018, 2019, 2020, 2018, 2019]
}
df = pd.DataFrame(sales)
df

   region   sales  year
0  EUROPA  153752  2018
1  EUROPA  168742  2019
2  EUROPA  162587  2020
3     USA  256198  2018
4     USA  285743  2019
5     USA  290371  2020
6   LATAM  145638  2018
7   LATAM  151678  2019

To observe the index of a dataframe we can use its attribute <code>**index**</code>

In [91]:
df.index

RangeIndex(start=0, stop=8, step=1)

Depending on how our data is formed, we will be able to create multi-indices based on our dataframe's own columns, if we look at the region and year columns that have repeated elements. This will allow us to do multi-indices where we have one continent per year of sales.

With the function <code> set_index()</code> we will be able to establish a new index

In [92]:
df_index = df.set_index(["region", "year"])
df_index

              sales
region year
EUROPA 2018  153752
       2019  168742
       2020  162587
USA    2018  256198
       2019  285743
       2020  290371
LATAM  2018  145638
       2019  151678

In view of the new dataframe, we can see that the region and year columns now act as an index, so if we query the first row...

In [93]:
df_index.iloc[0]

sales    153752
Name: (EUROPA, 2018), dtype: int64

We obtain the data that belongs to the sales volume, being the region (Europe) and the year (2018) its indices

Similarly, we can pass a list as an index to a dataframe. Obviously, this list must be the same length as the dataframe.

In [94]:
index_list = ["Rec_1", "Rec_2", "Rec_3", "Rec_4", "Rec_5", "Rec_6", "Rec_7", "Rec_8"]

index_list

['Rec_1', 'Rec_2', 'Rec_3', 'Rec_4', 'Rec_5', 'Rec_6', 'Rec_7', 'Rec_8']

In [95]:
df_index.index

MultiIndex([('EUROPA', 2018),
            ('EUROPA', 2019),
            ('EUROPA', 2020),
            (   'USA', 2018),
            (   'USA', 2019),
            (   'USA', 2020),
            ( 'LATAM', 2018),
            ( 'LATAM', 2019)],
           names=['region', 'year'])

In [96]:
df.index

RangeIndex(start=0, stop=8, step=1)

In [97]:
df.index = index_list

In [98]:
df

       region   sales  year
Rec_1  EUROPA  153752  2018
Rec_2  EUROPA  168742  2019
Rec_3  EUROPA  162587  2020
Rec_4     USA  256198  2018
Rec_5     USA  285743  2019
Rec_6     USA  290371  2020
Rec_7   LATAM  145638  2018
Rec_8   LATAM  151678  2019

With the <code>.loc</code> function we can search for elements in the index

In [99]:
df_index

              sales
region year
EUROPA 2018  153752
       2019  168742
       2020  162587
USA    2018  256198
       2019  285743
       2020  290371
LATAM  2018  145638
       2019  151678

In [100]:
df_index.loc["EUROPA"]

       sales
year
2018  153752
2019  168742
2020  162587

In [101]:
df

       region   sales  year
Rec_1  EUROPA  153752  2018
Rec_2  EUROPA  168742  2019
Rec_3  EUROPA  162587  2020
Rec_4     USA  256198  2018
Rec_5     USA  285743  2019
Rec_6     USA  290371  2020
Rec_7   LATAM  145638  2018
Rec_8   LATAM  151678  2019

In [102]:
df.loc["Rec_4"]

region       USA
sales     256198
year        2018
Name: Rec_4, dtype: object

In [103]:
type(df.loc["Rec_4"])

pandas.core.series.Series

In [104]:
df.loc["Rec_4"].values

array(['USA', 256198, 2018], dtype=object)

### Some basic functions of a dataframe

Next, we are going to see a list of some of the main functions that we can apply in a dataframe to operate on its columns:

* Get the first rows of a dataframe with __<code>.head</code>__
* Get the last rows of a dataframe with __<code>.tail</code>__
* Get the unique elements of a dataframe column with __<code>.unique</code>__
* Get the frequency of the unique values ​​of a column of a dataframe __<code>.value_counts</code>__
* Obtain a statistical summary of the dataset with __<code>.describe</code>__
* Get the mean of a column with __<code>.mean</code>__
* Get a copy of a dataframe with __<code>.copy</code>__
* View the column names of a dataframe with __<code>.columns</code>__
* Get the correlation between all numeric variables with __<code>.corr</code>__
* Remove duplicates from a dataframe with __<code>.drop_duplicates</code>__
* Especially for Big Data sets we can see the RAM memory consumption of our dataset with __<code>.memory_usage</code>__
* See a graphical summary summary (based on density, scatter plots and correlation plots) of all variables in the dataframe with __<code>.scatter_matrix</code>__
* Obtain a histogram of each numerical variable of the dataset with __<code>.hist</code>__

### First rows of a dataframe

In [105]:
df = pd.read_csv("CR_Files/housing_California.csv")
df.head()

,longitude,latitude,housing_median_age,total_rooms,total_bedrooms,population,households,median_income,median_house_value,ocean_proximity
0,-122.23,37.88,41.0,880.0,129.0,322.0,126.0,8.3252,452600.0,NEAR BAY
1,-122.22,37.86,21.0,7099.0,1106.0,2401.0,1138.0,8.3014,358500.0,NEAR BAY
2,-122.24,37.85,52.0,1467.0,190.0,496.0,177.0,7.2574,352100.0,NEAR BAY
3,-122.25,37.85,52.0,1274.0,235.0,558.0,219.0,5.6431,341300.0,NEAR BAY
4,-122.25,37.85,52.0,1627.0,280.0,565.0,259.0,3.8462,342200.0,NEAR BAY

If in .head() we don't specify anything, by default, 5 are shown, we can specify the number of rows to show.

In [106]:
df.head(20)

,longitude,latitude,housing_median_age,total_rooms,total_bedrooms,population,households,median_income,median_house_value,ocean_proximity
0,-122.23,37.88,41.0,880.0,129.0,322.0,126.0,8.3252,452600.0,NEAR BAY
1,-122.22,37.86,21.0,7099.0,1106.0,2401.0,1138.0,8.3014,358500.0,NEAR BAY
2,-122.24,37.85,52.0,1467.0,190.0,496.0,177.0,7.2574,352100.0,NEAR BAY
3,-122.25,37.85,52.0,1274.0,235.0,558.0,219.0,5.6431,341300.0,NEAR BAY
4,-122.25,37.85,52.0,1627.0,280.0,565.0,259.0,3.8462,342200.0,NEAR BAY
5,-122.25,37.85,52.0,919.0,213.0,413.0,193.0,4.0368,269700.0,NEAR BAY
6,-122.25,37.84,52.0,2535.0,489.0,1094.0,514.0,3.6591,299200.0,NEAR BAY
7,-122.25,37.84,52.0,3104.0,687.0,1157.0,647.0,3.1200,241400.0,NEAR BAY
8,-122.26,37.84,42.0,2555.0,665.0,1206.0,595.0,2.0804,226700.0,NEAR BAY
9,-122.25,37.84,52.0,3549.0,707.0,1551.0,714.0,3.6912,261100.0,NEAR BAY
10,-122.26,37.85,52.0,2202.0,434.0,910.0,402.0,3.2031,281500.0,NEAR BAY
11,-122.26,37.85,52.0,3503.0,752.0,1504.0,734.0,3.2705,241800.0,NEAR BAY
12,-122.26,37.85,52.0,2491.0,474.0,1098.0,468.0,3.0750,213500.0,NEAR BAY
13,-122.26,37.84,52.0,696.0,191.0,345.0,174.0,2.6736,191300.0,NEAR BAY
14,-122.26,37.85,52.0,2643.0,626.0,1212.0,620.0,1.9167,159200.0,NEAR BAY
15,-122.26,37.85,50.0,1120.0,283.0,697.0,264.0,2.1250,140000.0,NEAR BAY
16,-122.27,37.85,52.0,1966.0,347.0,793.0,331.0,2.7750,152500.0,NEAR BAY
17,-122.27,37.85,52.0,1228.0,293.0,648.0,303.0,2.1202,155500.0,NEAR BAY
18,-122.26,37.84,50.0,2239.0,455.0,990.0,419.0,1.9911,158700.0,NEAR BAY
19,-122.27,37.84,52.0,1503.0,298.0,690.0,275.0,2.6033,162900.0,NEAR BAY

### Last Rows of a Dataframe

The same happens with the __tail__ command, if we do not pass the number of rows to display as a parameter, it will take the last 5

In [107]:
df.tail()

,longitude,latitude,housing_median_age,total_rooms,total_bedrooms,population,households,median_income,median_house_value,ocean_proximity
20635,-121.09,39.48,25.0,1665.0,374.0,845.0,330.0,1.5603,78100.0,INLAND
20636,-121.21,39.49,18.0,697.0,150.0,356.0,114.0,2.5568,77100.0,INLAND
20637,-121.22,39.43,17.0,2254.0,485.0,1007.0,433.0,1.7000,92300.0,INLAND
20638,-121.32,39.43,18.0,1860.0,409.0,741.0,349.0,1.8672,84700.0,INLAND
20639,-121.24,39.37,16.0,2785.0,616.0,1387.0,530.0,2.3886,89400.0,INLAND

In [108]:
df.tail(20)

,longitude,latitude,housing_median_age,total_rooms,total_bedrooms,population,households,median_income,median_house_value,ocean_proximity
20620,-121.48,39.05,40.0,198.0,41.0,151.0,48.0,4.5625,100000.0,INLAND
20621,-121.47,39.01,37.0,1244.0,247.0,484.0,157.0,2.3661,77500.0,INLAND
20622,-121.44,39.00,20.0,755.0,147.0,457.0,157.0,2.4167,67000.0,INLAND
20623,-121.37,39.03,32.0,1158.0,244.0,598.0,227.0,2.8235,65500.0,INLAND
20624,-121.41,39.04,16.0,1698.0,300.0,731.0,291.0,3.0739,87200.0,INLAND
20625,-121.52,39.12,37.0,102.0,17.0,29.0,14.0,4.1250,72000.0,INLAND
20626,-121.43,39.18,36.0,1124.0,184.0,504.0,171.0,2.1667,93800.0,INLAND
20627,-121.32,39.13,5.0,358.0,65.0,169.0,59.0,3.0000,162500.0,INLAND
20628,-121.48,39.10,19.0,2043.0,421.0,1018.0,390.0,2.5952,92400.0,INLAND
20629,-121.39,39.12,28.0,10035.0,1856.0,6912.0,1818.0,2.0943,108300.0,INLAND
20630,-121.32,39.29,11.0,2640.0,505.0,1257.0,445.0,3.5673,112000.0,INLAND
20631,-121.40,39.33,15.0,2655.0,493.0,1200.0,432.0,3.5179,107200.0,INLAND
20632,-121.45,39.26,15.0,2319.0,416.0,1047.0,385.0,3.1250,115600.0,INLAND
20633,-121.53,39.19,27.0,2080.0,412.0,1082.0,382.0,2.5495,98300.0,INLAND
20634,-121.56,39.27,28.0,2332.0,395.0,1041.0,344.0,3.7125,116800.0,INLAND
20635,-121.09,39.48,25.0,1665.0,374.0,845.0,330.0,1.5603,78100.0,INLAND
20636,-121.21,39.49,18.0,697.0,150.0,356.0,114.0,2.5568,77100.0,INLAND
20637,-121.22,39.43,17.0,2254.0,485.0,1007.0,433.0,1.7000,92300.0,INLAND
20638,-121.32,39.43,18.0,1860.0,409.0,741.0,349.0,1.8672,84700.0,INLAND
20639,-121.24,39.37,16.0,2785.0,616.0,1387.0,530.0,2.3886,89400.0,INLAND

In [109]:
df

,longitude,latitude,housing_median_age,total_rooms,total_bedrooms,population,households,median_income,median_house_value,ocean_proximity
0,-122.23,37.88,41.0,880.0,129.0,322.0,126.0,8.3252,452600.0,NEAR BAY
1,-122.22,37.86,21.0,7099.0,1106.0,2401.0,1138.0,8.3014,358500.0,NEAR BAY
2,-122.24,37.85,52.0,1467.0,190.0,496.0,177.0,7.2574,352100.0,NEAR BAY
3,-122.25,37.85,52.0,1274.0,235.0,558.0,219.0,5.6431,341300.0,NEAR BAY
4,-122.25,37.85,52.0,1627.0,280.0,565.0,259.0,3.8462,342200.0,NEAR BAY
...,...,...,...,...,...,...,...,...,...,...
20635,-121.09,39.48,25.0,1665.0,374.0,845.0,330.0,1.5603,78100.0,INLAND
20636,-121.21,39.49,18.0,697.0,150.0,356.0,114.0,2.5568,77100.0,INLAND
20637,-121.22,39.43,17.0,2254.0,485.0,1007.0,433.0,1.7000,92300.0,INLAND
20638,-121.32,39.43,18.0,1860.0,409.0,741.0,349.0,1.8672,84700.0,INLAND
20639,-121.24,39.37,16.0,2785.0,616.0,1387.0,530.0,2.3886,89400.0,INLAND

### Unique values by column

In [110]:
df.ocean_proximity.unique()

array(['NEAR BAY', '<1H OCEAN', 'INLAND', 'NEAR OCEAN', 'ISLAND'],
      dtype=object)

In [111]:
df.median_house_value.unique()

array([452600., 358500., 352100., ..., 425800., 200700.,  47000.])

As we can see, this is a function that has a greater impact on categorical variables, since in general, numerical variables have too many different values.

### Summary with statistics

In [112]:
df.describe()

,longitude,latitude,housing_median_age,total_rooms,total_bedrooms,population,households,median_income,median_house_value
count,20640.000000,20640.000000,20640.000000,20640.000000,20433.000000,20640.000000,20640.000000,20640.000000,20640.000000
mean,-119.569704,35.631861,28.639486,2635.763081,537.870553,1425.476744,499.539680,3.870671,206855.816909
std,2.003532,2.135952,12.585558,2181.615252,421.385070,1132.462122,382.329753,1.899822,115395.615874
min,-124.350000,32.540000,1.000000,2.000000,1.000000,3.000000,1.000000,0.499900,14999.000000
25%,-121.800000,33.930000,18.000000,1447.750000,296.000000,787.000000,280.000000,2.563400,119600.000000
50%,-118.490000,34.260000,29.000000,2127.000000,435.000000,1166.000000,409.000000,3.534800,179700.000000
75%,-118.010000,37.710000,37.000000,3148.000000,647.000000,1725.000000,605.000000,4.743250,264725.000000
max,-114.310000,41.950000,52.000000,39320.000000,6445.000000,35682.000000,6082.000000,15.000100,500001.000000

In [113]:
# 15 + 96
# 20 + 45
# 3 + 3
# 20 + 99

# 2565988784156 + 654548974894

https://www.kdnuggets.com/2019/11/understanding-boxplots.html

It is interesting to note that the statistical summary automatically discards any variable that is not numerical.

In [114]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20640 entries, 0 to 20639
Data columns (total 10 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   longitude           20640 non-null  float64
 1   latitude            20640 non-null  float64
 2   housing_median_age  20640 non-null  float64
 3   total_rooms         20640 non-null  float64
 4   total_bedrooms      20433 non-null  float64
 5   population          20640 non-null  float64
 6   households          20640 non-null  float64
 7   median_income       20640 non-null  float64
 8   median_house_value  20640 non-null  float64
 9   ocean_proximity     20640 non-null  object
dtypes: float64(9), object(1)
memory usage: 1.6+ MB

In [115]:
# Object -> Categórica | Category
#        -> Fecha  | Datetime
#        -> String | str

In [116]:
df.describe(include="object")

       ocean_proximity
count            20640
unique               5
top          <1H OCEAN
freq              9136

In [117]:
df.describe(include="all")

,longitude,latitude,housing_median_age,total_rooms,total_bedrooms,population,households,median_income,median_house_value,ocean_proximity
count,20640.000000,20640.000000,20640.000000,20640.000000,20433.000000,20640.000000,20640.000000,20640.000000,20640.000000,20640
unique,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,5
top,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,<1H OCEAN
freq,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,9136
mean,-119.569704,35.631861,28.639486,2635.763081,537.870553,1425.476744,499.539680,3.870671,206855.816909,NaN
std,2.003532,2.135952,12.585558,2181.615252,421.385070,1132.462122,382.329753,1.899822,115395.615874,NaN
min,-124.350000,32.540000,1.000000,2.000000,1.000000,3.000000,1.000000,0.499900,14999.000000,NaN
25%,-121.800000,33.930000,18.000000,1447.750000,296.000000,787.000000,280.000000,2.563400,119600.000000,NaN
50%,-118.490000,34.260000,29.000000,2127.000000,435.000000,1166.000000,409.000000,3.534800,179700.000000,NaN
75%,-118.010000,37.710000,37.000000,3148.000000,647.000000,1725.000000,605.000000,4.743250,264725.000000,NaN
max,-114.310000,41.950000,52.000000,39320.000000,6445.000000,35682.000000,6082.000000,15.000100,500001.000000,NaN

In [118]:
df.describe().index

Index(['count', 'mean', 'std', 'min', '25%', '50%', '75%', 'max'], dtype='object')

In [119]:
df.describe().loc["std"]

longitude                  2.003532
latitude                   2.135952
housing_median_age        12.585558
total_rooms             2181.615252
total_bedrooms           421.385070
population              1132.462122
households               382.329753
median_income              1.899822
median_house_value    115395.615874
Name: std, dtype: float64

In [120]:
df.describe()["total_rooms"]

count    20640.000000
mean      2635.763081
std       2181.615252
min          2.000000
25%       1447.750000
50%       2127.000000
75%       3148.000000
max      39320.000000
Name: total_rooms, dtype: float64

In [121]:
df.describe()["total_rooms"]["count"]

20640.0

In [122]:
df.total_rooms.describe()

count    20640.000000
mean      2635.763081
std       2181.615252
min          2.000000
25%       1447.750000
50%       2127.000000
75%       3148.000000
max      39320.000000
Name: total_rooms, dtype: float64

### Mean of a column

In [123]:
df.total_rooms.mean()

2635.7630813953488

In [124]:
round(df.total_rooms.mean(), 3)

2635.763

## Filtering columns

In [125]:
df.describe()

,longitude,latitude,housing_median_age,total_rooms,total_bedrooms,population,households,median_income,median_house_value
count,20640.000000,20640.000000,20640.000000,20640.000000,20433.000000,20640.000000,20640.000000,20640.000000,20640.000000
mean,-119.569704,35.631861,28.639486,2635.763081,537.870553,1425.476744,499.539680,3.870671,206855.816909
std,2.003532,2.135952,12.585558,2181.615252,421.385070,1132.462122,382.329753,1.899822,115395.615874
min,-124.350000,32.540000,1.000000,2.000000,1.000000,3.000000,1.000000,0.499900,14999.000000
25%,-121.800000,33.930000,18.000000,1447.750000,296.000000,787.000000,280.000000,2.563400,119600.000000
50%,-118.490000,34.260000,29.000000,2127.000000,435.000000,1166.000000,409.000000,3.534800,179700.000000
75%,-118.010000,37.710000,37.000000,3148.000000,647.000000,1725.000000,605.000000,4.743250,264725.000000
max,-114.310000,41.950000,52.000000,39320.000000,6445.000000,35682.000000,6082.000000,15.000100,500001.000000

In [126]:
df[ (df["housing_median_age"] <= 28.63)  ]

,longitude,latitude,housing_median_age,total_rooms,total_bedrooms,population,households,median_income,median_house_value,ocean_proximity
1,-122.22,37.86,21.0,7099.0,1106.0,2401.0,1138.0,8.3014,358500.0,NEAR BAY
50,-122.27,37.82,21.0,896.0,453.0,735.0,438.0,0.9218,171900.0,NEAR BAY
59,-122.29,37.82,2.0,158.0,43.0,94.0,57.0,2.5625,60000.0,NEAR BAY
70,-122.29,37.81,26.0,768.0,152.0,392.0,127.0,1.7719,82500.0,NEAR BAY
74,-122.29,37.81,20.0,835.0,161.0,290.0,133.0,2.4830,137500.0,NEAR BAY
...,...,...,...,...,...,...,...,...,...,...
20635,-121.09,39.48,25.0,1665.0,374.0,845.0,330.0,1.5603,78100.0,INLAND
20636,-121.21,39.49,18.0,697.0,150.0,356.0,114.0,2.5568,77100.0,INLAND
20637,-121.22,39.43,17.0,2254.0,485.0,1007.0,433.0,1.7000,92300.0,INLAND
20638,-121.32,39.43,18.0,1860.0,409.0,741.0,349.0,1.8672,84700.0,INLAND
20639,-121.24,39.37,16.0,2785.0,616.0,1387.0,530.0,2.3886,89400.0,INLAND

In [127]:
df[ (df["housing_median_age"] <= 28.63)  ][:2]

,longitude,latitude,housing_median_age,total_rooms,total_bedrooms,population,households,median_income,median_house_value,ocean_proximity
1,-122.22,37.86,21.0,7099.0,1106.0,2401.0,1138.0,8.3014,358500.0,NEAR BAY
50,-122.27,37.82,21.0,896.0,453.0,735.0,438.0,0.9218,171900.0,NEAR BAY

In [128]:
df["housing_median_age"] <= 28.63 # Máscara booleana

0        False
1         True
2        False
3        False
4        False
         ...
20635     True
20636     True
20637     True
20638     True
20639     True
Name: housing_median_age, Length: 20640, dtype: bool

In [129]:
df[ (df["housing_median_age"] <= 28.63)  ][-15:-5]

,longitude,latitude,housing_median_age,total_rooms,total_bedrooms,population,households,median_income,median_house_value,ocean_proximity
20622,-121.44,39.00,20.0,755.0,147.0,457.0,157.0,2.4167,67000.0,INLAND
20624,-121.41,39.04,16.0,1698.0,300.0,731.0,291.0,3.0739,87200.0,INLAND
20627,-121.32,39.13,5.0,358.0,65.0,169.0,59.0,3.0000,162500.0,INLAND
20628,-121.48,39.10,19.0,2043.0,421.0,1018.0,390.0,2.5952,92400.0,INLAND
20629,-121.39,39.12,28.0,10035.0,1856.0,6912.0,1818.0,2.0943,108300.0,INLAND
20630,-121.32,39.29,11.0,2640.0,505.0,1257.0,445.0,3.5673,112000.0,INLAND
20631,-121.40,39.33,15.0,2655.0,493.0,1200.0,432.0,3.5179,107200.0,INLAND
20632,-121.45,39.26,15.0,2319.0,416.0,1047.0,385.0,3.1250,115600.0,INLAND
20633,-121.53,39.19,27.0,2080.0,412.0,1082.0,382.0,2.5495,98300.0,INLAND
20634,-121.56,39.27,28.0,2332.0,395.0,1041.0,344.0,3.7125,116800.0,INLAND

In [130]:
df[ (df["housing_median_age"] <= 28.63)  ].iloc[20623]

IndexError: single positional indexer is out-of-bounds

In [ ]:
# MEDIA = 28.63
media = round(df.housing_median_age.mean(),2)

In [ ]:
df[ (df["housing_median_age"] <= media) ]

In [ ]:
df.describe()

In [ ]:
# and - &
# or  - |

In [ ]:
df[ (df["housing_median_age"] <= media) & (df.total_bedrooms < 600)]

In [ ]:
df[ (df["housing_median_age"] <= media) & (df.total_bedrooms < 600)].describe()

In [ ]:
import numpy as np

In [ ]:
df.total_rooms.describe()["max"]

In [ ]:
np.percentile(df.total_rooms, 99)

In [ ]:
np.percentile(df.total_rooms, 98)

### Copy a dataframe

As in lists and arrays, dataframes share memory. It is easy to make a mistake and assign a complete dataframe to a new variable, later, in this new variable make modifications, thinking that we are only making them in the copy of the dataframe, but it is not like that, we are making modifications in both dataframes since being stored in memory, they share the same positions, let's see an example of how NOT to copy a dataframe.

In [ ]:
df_copia = df.head()
df_copia

In [ ]:
df_copia.iloc[[0]] = np.zeros(len(df.columns))
df_copia

changes made in bad_copy reflects to original data

In [ ]:
df

Therefore, we have modified both dataframes, to only make modifications on the copy, we have to use the command <code>.copy</code>

In [ ]:
df = pd.read_csv("CR_Files/housing_California.csv")

In [ ]:
df_cabecera = df.head().copy()
df_cabecera.iloc[[0]] = np.zeros(len(df.columns))
df_cabecera

In [ ]:
df.head()

### Correlation matrix

In [ ]:
df.corr()

Only numeric values will be taken

### Names of columns

In [ ]:
df.columns

Columns attribute work as list

### Managing Duplicates

In [ ]:
df_veinte = df.head(21).copy()

df_veinte = df_veinte.append(df_veinte.iloc[[20]])
df_veinte = df_veinte.append(df_veinte.iloc[[20]])
df_veinte = df_veinte.append(df_veinte.iloc[[20]])
df_veinte = df_veinte.append(df_veinte.iloc[[20]])
df_veinte = df_veinte.append(df_veinte.iloc[[20]])
df_veinte = df_veinte.append(df_veinte.iloc[[20]])

In [ ]:
df_veinte

In [ ]:
df_veinte = df_veinte.drop_duplicates(keep="first", inplace=False)
df_veinte

In [ ]:
df_veinte = df.head(21).copy()

df_veinte = df_veinte.append(df_veinte.iloc[[20]])
df_veinte = df_veinte.append(df_veinte.iloc[[20]])
df_veinte = df_veinte.append(df_veinte.iloc[[20]])
df_veinte = df_veinte.append(df_veinte.iloc[[20]])
df_veinte = df_veinte.append(df_veinte.iloc[[20]])
df_veinte = df_veinte.append(df_veinte.iloc[[20]])

# Si asignas con inplace True, no tienes nada
df_veinte = df_veinte.drop_duplicates(keep="first", inplace=True)
df_veinte

In [ ]:
# Si utilizas inplace True, no asignes variable
df_veinte = df.head(21).copy()

df_veinte = df_veinte.append(df_veinte.iloc[[20]])
df_veinte = df_veinte.append(df_veinte.iloc[[20]])
df_veinte = df_veinte.append(df_veinte.iloc[[20]])
df_veinte = df_veinte.append(df_veinte.iloc[[20]])
df_veinte = df_veinte.append(df_veinte.iloc[[20]])
df_veinte = df_veinte.append(df_veinte.iloc[[20]])

df_veinte.drop_duplicates(keep="first", inplace=True)
df_veinte

### RAM usage of a Dataframe

In [ ]:
df.memory_usage()

### Scatter Matrix

In [ ]:
from pandas.plotting import scatter_matrix

scatter_matrix(df, figsize=(len(df.columns), len(df.columns)))

### Numeric columns histogramas

In [ ]:
df.hist(figsize=(len(df.columns), len(df.columns)))

### Changing the type of variables.

With the `info` function we can obtain the information of the type of variables.

In [ ]:
df.info()

As we can see, all the variables are of type float, except ocean_proximity which is of type object, when the reality is that this is not the case, some of the most important transformations that we can perform in a dataframe on its variables is to change their type , that is, they become categorical or date type, we are going to see how to change the variables of a dataframe to a categorical type.

One of the possible ways to change the type of a variable is through `pd.Categorical`

In [ ]:
df["ocean_proximity"] = pd.Categorical(df["ocean_proximity"])

Show again the info of the df

In [ ]:
df.info()

Now, we can include category type into the summary

In [ ]:
df.describe(include="category")

### GROUPING DATAFRAMES - GROUP BY

As in SQL, from Python we can also group our data with the function __<code>groupby</code>__

In [ ]:
df.groupby(["ocean_proximity"]).mean()

In [ ]:
df.groupby(["ocean_proximity"]).max()

In [ ]:
df.groupby(["ocean_proximity", "housing_median_age"]).mean()

### DATAFRAME MERGE

On some occasions, we will need to join two or more datasets to do this, first of all, as with lists, we can use the function __<code>.append</code>__

Due to the dimension of rows and columns of the dataframe, we are going to create two smaller dataframes to be able to correctly instantiate the append function.

In [ ]:
df.columns

In [ ]:
first_positions = df[['longitude', 'latitude', 'housing_median_age', 'total_rooms']].head().copy()
last_positions = df[['longitude', 'latitude', 'housing_median_age', 
                     'total_rooms', "ocean_proximity"]].tail().copy()

In [ ]:
first_positions.append(last_positions)

It is important that we take into account the presence of new columns that appear only in one of the dataframes that we are going to concatenate. To exemplify it, we are going to obtain the datasets again, giving one more column to the dataset with the last positions.

Second, we can make use of the __<code>.concat</code>__ function. It is very important to know the types of union ( _join_ ) that we can perform when concatenating datasets
* __inner__: The union is performed by the common elements of both datasets.
* __outer__: The union is performed by all the elements between the datasets
    
It is recommended to take a look at the documentation to see the different types of join that we can perform https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.concat.html

![FB_IMG_1650437650199.jpg](Images/FB_IMG_1650437650199.jpg)

In [ ]:
first_positions = df[['longitude', 'latitude', 'housing_median_age', 'total_rooms']].head().copy()
last_positions = df[['longitude', 'latitude', 'housing_median_age', 
                     'total_rooms', "ocean_proximity"]].tail().copy()

In [ ]:
concatenacion = pd.concat([first_positions, last_positions], join="inner")
concatenacion

In [ ]:
concatenacion = pd.concat([first_positions, last_positions], join="outer")
concatenacion

In [ ]:
concatenacion = pd.concat([first_positions, last_positions], join="outer", ignore_index=True)
concatenacion

Compo we can see in the merge by type _inner_ the column _households_ of the new dataset does not appear since it is not a common element between both datasets. However, we must take into account that if a dataset does not have rows belonging to a column of another dataset, as is the case of the _households_ column, which only appears in the new dataset. Their values will become null.

### NEW COLUMNS

On many occasions, we will need to add new columns to a dataframe or make changes between the columns of a dataframe to obtain a new one. It is important to know that the operations are performed in a columnar way, that is, if two columns have the same length, we can perform an operation between them without needing to iterate over their rows.

To add a new column we can simply create a new variable with the name of the dataframe and the name of the column that we are going to create.

In [ ]:
concatenacion["NUEVA_COLUMNAS"] = np.ones(len(concatenacion))

In [ ]:
concatenacion

In [ ]:
concatenacion["COLUMNA_TRANSFORMACION"] = (concatenacion.latitude - concatenacion.longitude) / 2

In [ ]:
concatenacion

### DELETE ROWS AND COLUMNS

On some occasions, when we perform data cleaning or, because they are not the object of our analysis, we will need to delete rows or columns from a dataframe, for both cases the function is the same __<code>.drop</code>__, if we want to perform the deletion for rows we will use the value 0 in the parameter __axis__ and for the columns the value 1.

In [ ]:
concatenacion.drop(["NUEVA_COLUMNAS"], axis=1, inplace=True)

In [ ]:
concatenacion.columns

In [ ]:
concatenacion.drop(8, axis=0, inplace=True)

In [ ]:
concatenacion

### NULL MANAGEMENT

Finally, as usual when working with dataframes, _missing values_ or simply null values can appear, in Python represented by the string __NaN__, through the __<code>.isnull</code>__ function we can know if an element of a dataframe is null or not, a very common practice is to obtain the number of null values per column in a dataframe and their percentage.

In [ ]:
concatenacion.isna()

In [ ]:
concatenacion.isna().sum()

In [ ]:
concatenacion.isna().sum() / len(concatenacion) *100

If what we want is to replace the null values ​​and not delete them, we will use the function __<code>.fillna</code>__

In [ ]:
concatenacion.ocean_proximity.fillna("ISLAND", inplace=True)

In [ ]:
concatenacion

On the contrary, if what we want is to delete the null values ​​of a dataframe we can use the function __<code>.dropna</code>__

In [ ]:
first_positions = df[['longitude', 'latitude', 'housing_median_age', 'total_rooms']].head().copy()
last_positions = df[['longitude', 'latitude', 'housing_median_age', 
                     'total_rooms', "ocean_proximity"]].tail().copy()

In [ ]:
nulos = first_positions.append(last_positions)

In [ ]:
nulos.dropna()

### Writing dataframe as csv

Just as we can load data from different data sources and process it as a data frame, we can also later write a data frame in one of the multiple sources that pandas accepts to export files, this time, we will dump the information of a data frame as a .csv , for this, we have the <code>**to_csv**</code> function. As parameters we will use the name of the file, the __sep__ argument to use one type of separator or another and, if we do not want the dataframe index to be displayed, we will use the __index__ argument with value _none_

In [ ]:
nulos.to_csv("CR_Files/Filtrado_nulos.csv", sep=",")

In [ ]:
nulos.to_csv("CR_Files/Filtrado_nulos_index.csv", index=None, sep=",")